# K - матрица жесткости системы, 3*3
# q - вектор-столбец наеизвестных узловых перемещений
# f - вектор-столбец известных внешних нагрузок

# Зададим жёсткости элементов и внешнее усилие
EF1 = 1
EF2 = 2
EF3 = 3
С = 2
F = 10

# Определим вектор усилий
f=[]

# Составим матрицы жесткости
K1 = [[EF1,-EF1],
      [-EF1, EF1]]
K2 = [[EF2,-EF2],
      [-EF2, EF2]]
K3 = [[EF3,-EF3],
      [-EF3, EF3]]
K4 = [[С,-С],
      [-С, С]]

# Определим общую матрицу

K = [[K4[0][0], K4[0][1], 0, 0, 0],
     [K4[1][0], K4[1][1] + K1[0][0], K1[0][1], 0, 0],
     [0, K1[1][0], K1[1][1] + K2[0][0], K2[0][1], 0],
     [0,0, K2[1][0], K2[1][1]+K3[0][0], K3[0][1]],
     [0,0,0, K3[1][0], K3[1][1]]
]

print('Матрица жёсткости системы: ', K)

# Введем граничные условия (левый конец балки закреплён)

K[0][0] = 1
for i in range (1,len(K)):
    K[0][i] = 0
for i in range(1, len(K)):
    K[i][0]=0

print('Матрица жёсткости системы c ГУ: ', K)

from math import inverse_matrix

invK = inverse_matrix(K)
